zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/isi.h
/* -------- ISI_R2Y_SET1 : (ISI Offset: 0x1c) (R/W 32) ISI Color Space Conversion RGB To YCrCb Set 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t C3:7;                      /**< bit:   0..6  Color Space Conversion Matrix Coefficient C3  */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t C4:7;                      /**< bit:  8..14  Color Space Conversion Matrix Coefficient C4  */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t C5:7;                      /**< bit: 16..22  Color Space Conversion Matrix Coefficient C5  */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t Goff:1;                    /**< bit:     24  Color Space Conversion Green Component Offset */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_R2Y_SET1_bits_t;

#define ISI_R2Y_SET1_C3_Pos                   (0)                                            /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C3 Position */
#define ISI_R2Y_SET1_C3_Msk                   (0x7FU << ISI_R2Y_SET1_C3_Pos)                 /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C3 Mask */
#define ISI_R2Y_SET1_C3(value)                (ISI_R2Y_SET1_C3_Msk & ((value) << ISI_R2Y_SET1_C3_Pos))
#define ISI_R2Y_SET1_C4_Pos                   (8)                                            /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C4 Position */
#define ISI_R2Y_SET1_C4_Msk                   (0x7FU << ISI_R2Y_SET1_C4_Pos)                 /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C4 Mask */
#define ISI_R2Y_SET1_C4(value)                (ISI_R2Y_SET1_C4_Msk & ((value) << ISI_R2Y_SET1_C4_Pos))
#define ISI_R2Y_SET1_C5_Pos                   (16)                                           /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C5 Position */
#define ISI_R2Y_SET1_C5_Msk                   (0x7FU << ISI_R2Y_SET1_C5_Pos)                 /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C5 Mask */
#define ISI_R2Y_SET1_C5(value)                (ISI_R2Y_SET1_C5_Msk & ((value) << ISI_R2Y_SET1_C5_Pos))
#define ISI_R2Y_SET1_Goff_Pos                 (24)                                           /**< (ISI_R2Y_SET1) Color Space Conversion Green Component Offset Position */
#define ISI_R2Y_SET1_Goff_Msk                 (0x1U << ISI_R2Y_SET1_Goff_Pos)                /**< (ISI_R2Y_SET1) Color Space Conversion Green Component Offset Mask */
#define ISI_R2Y_SET1_Msk                      (0x017F7F7FUL)                                 /**< (ISI_R2Y_SET1) Register Mask  */

/* -------- ISI_R2Y_SET2 : (ISI Offset: 0x20) (R/W 32) ISI Color Space Conversion RGB To YCrCb Set 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t C6:7;                      /**< bit:   0..6  Color Space Conversion Matrix Coefficient C6  */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t C7:7;                      /**< bit:  8..14  Color Space Conversion Matrix Coefficient C7  */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t C8:7;                      /**< bit: 16..22  Color Space Conversion Matrix Coefficient C8  */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t Boff:1;                    /**< bit:     24  Color Space Conversion Blue Component Offset  */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_R2Y_SET2_bits_t;

#define ISI_R2Y_SET2_C6_Pos                   (0)                                            /**< (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C6 Position */
#define ISI_R2Y_SET2_C6_Msk                   (0x7FU << ISI_R2Y_SET2_C6_Pos)                 /**< (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C6 Mask */
#define ISI_R2Y_SET2_C6(value)                (ISI_R2Y_SET2_C6_Msk & ((value) << ISI_R2Y_SET2_C6_Pos))
#define ISI_R2Y_SET2_C7_Pos                   (8)                                            /**< (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C7 Position */
#define ISI_R2Y_SET2_C7_Msk                   (0x7FU << ISI_R2Y_SET2_C7_Pos)                 /**< (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C7 Mask */
#define ISI_R2Y_SET2_C7(value)                (ISI_R2Y_SET2_C7_Msk & ((value) << ISI_R2Y_SET2_C7_Pos))
#define ISI_R2Y_SET2_C8_Pos                   (16)                                           /**< (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C8 Position */
#define ISI_R2Y_SET2_C8_Msk                   (0x7FU << ISI_R2Y_SET2_C8_Pos)                 /**< (ISI_R2Y_SET2) Color Space Conversion Matrix Coefficient C8 Mask */
#define ISI_R2Y_SET2_C8(value)                (ISI_R2Y_SET2_C8_Msk & ((value) << ISI_R2Y_SET2_C8_Pos))
#define ISI_R2Y_SET2_Boff_Pos                 (24)                                           /**< (ISI_R2Y_SET2) Color Space Conversion Blue Component Offset Position */
#define ISI_R2Y_SET2_Boff_Msk                 (0x1U << ISI_R2Y_SET2_Boff_Pos)                /**< (ISI_R2Y_SET2) Color Space Conversion Blue Component Offset Mask */
#define ISI_R2Y_SET2_Msk                      (0x017F7F7FUL)                                 /**< (ISI_R2Y_SET2) Register Mask  */

/* -------- ISI_CR : (ISI Offset: 0x24) (/W 32) ISI Control Register -------- */

typedef union
{
  struct
  {
    uint32_t ISI_EN:1;                  /**< bit:      0  ISI Module Enable Request                     */
    uint32_t ISI_DIS:1;                 /**< bit:      1  ISI Module Disable Request                    */
    uint32_t ISI_SRST:1;                /**< bit:      2  ISI Software Reset Request                    */
    uint32_t :5;                        /**< bit:   3..7  Reserved                                      */
    uint32_t ISI_CDC:1;                 /**< bit:      8  ISI Codec Request                             */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_CR_bits_t;

#define ISI_CR_ISI_EN_Pos                     (0)                                            /**< (ISI_CR) ISI Module Enable Request Position */
#define ISI_CR_ISI_EN_Msk                     (0x1U << ISI_CR_ISI_EN_Pos)                    /**< (ISI_CR) ISI Module Enable Request Mask */
#define ISI_CR_ISI_DIS_Pos                    (1)                                            /**< (ISI_CR) ISI Module Disable Request Position */
#define ISI_CR_ISI_DIS_Msk                    (0x1U << ISI_CR_ISI_DIS_Pos)                   /**< (ISI_CR) ISI Module Disable Request Mask */
#define ISI_CR_ISI_SRST_Pos                   (2)                                            /**< (ISI_CR) ISI Software Reset Request Position */
#define ISI_CR_ISI_SRST_Msk                   (0x1U << ISI_CR_ISI_SRST_Pos)                  /**< (ISI_CR) ISI Software Reset Request Mask */
#define ISI_CR_ISI_CDC_Pos                    (8)                                            /**< (ISI_CR) ISI Codec Request Position */
#define ISI_CR_ISI_CDC_Msk                    (0x1U << ISI_CR_ISI_CDC_Pos)                   /**< (ISI_CR) ISI Codec Request Mask */
#define ISI_CR_Msk                            (0x00000107UL)                                 /**< (ISI_CR) Register Mask  */

