zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/isi.h
/* -------- ISI_SR : (ISI Offset: 0x28) (R/ 32) ISI Status Register -------- */

typedef union
{
  struct
  {
    uint32_t ENABLE:1;                  /**< bit:      0  Module Enable                                 */
    uint32_t DIS_DONE:1;                /**< bit:      1  Module Disable Request has Terminated (cleared on read) */
    uint32_t SRST:1;                    /**< bit:      2  Module Software Reset Request has Terminated (cleared on read) */
    uint32_t :5;                        /**< bit:   3..7  Reserved                                      */
    uint32_t CDC_PND:1;                 /**< bit:      8  Pending Codec Request                         */
    uint32_t :1;                        /**< bit:      9  Reserved                                      */
    uint32_t VSYNC:1;                   /**< bit:     10  Vertical Synchronization (cleared on read)    */
    uint32_t :5;                        /**< bit: 11..15  Reserved                                      */
    uint32_t PXFR_DONE:1;               /**< bit:     16  Preview DMA Transfer has Terminated (cleared on read) */
    uint32_t CXFR_DONE:1;               /**< bit:     17  Codec DMA Transfer has Terminated (cleared on read) */
    uint32_t :1;                        /**< bit:     18  Reserved                                      */
    uint32_t SIP:1;                     /**< bit:     19  Synchronization in Progress                   */
    uint32_t :4;                        /**< bit: 20..23  Reserved                                      */
    uint32_t P_OVR:1;                   /**< bit:     24  Preview Datapath Overflow (cleared on read)   */
    uint32_t C_OVR:1;                   /**< bit:     25  Codec Datapath Overflow (cleared on read)     */
    uint32_t CRC_ERR:1;                 /**< bit:     26  CRC Synchronization Error (cleared on read)   */
    uint32_t FR_OVR:1;                  /**< bit:     27  Frame Rate Overrun (cleared on read)          */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_SR_bits_t;

#define ISI_SR_ENABLE_Pos                     (0)                                            /**< (ISI_SR) Module Enable Position */
#define ISI_SR_ENABLE_Msk                     (0x1U << ISI_SR_ENABLE_Pos)                    /**< (ISI_SR) Module Enable Mask */
#define ISI_SR_DIS_DONE_Pos                   (1)                                            /**< (ISI_SR) Module Disable Request has Terminated (cleared on read) Position */
#define ISI_SR_DIS_DONE_Msk                   (0x1U << ISI_SR_DIS_DONE_Pos)                  /**< (ISI_SR) Module Disable Request has Terminated (cleared on read) Mask */
#define ISI_SR_SRST_Pos                       (2)                                            /**< (ISI_SR) Module Software Reset Request has Terminated (cleared on read) Position */
#define ISI_SR_SRST_Msk                       (0x1U << ISI_SR_SRST_Pos)                      /**< (ISI_SR) Module Software Reset Request has Terminated (cleared on read) Mask */
#define ISI_SR_CDC_PND_Pos                    (8)                                            /**< (ISI_SR) Pending Codec Request Position */
#define ISI_SR_CDC_PND_Msk                    (0x1U << ISI_SR_CDC_PND_Pos)                   /**< (ISI_SR) Pending Codec Request Mask */
#define ISI_SR_VSYNC_Pos                      (10)                                           /**< (ISI_SR) Vertical Synchronization (cleared on read) Position */
#define ISI_SR_VSYNC_Msk                      (0x1U << ISI_SR_VSYNC_Pos)                     /**< (ISI_SR) Vertical Synchronization (cleared on read) Mask */
#define ISI_SR_PXFR_DONE_Pos                  (16)                                           /**< (ISI_SR) Preview DMA Transfer has Terminated (cleared on read) Position */
#define ISI_SR_PXFR_DONE_Msk                  (0x1U << ISI_SR_PXFR_DONE_Pos)                 /**< (ISI_SR) Preview DMA Transfer has Terminated (cleared on read) Mask */
#define ISI_SR_CXFR_DONE_Pos                  (17)                                           /**< (ISI_SR) Codec DMA Transfer has Terminated (cleared on read) Position */
#define ISI_SR_CXFR_DONE_Msk                  (0x1U << ISI_SR_CXFR_DONE_Pos)                 /**< (ISI_SR) Codec DMA Transfer has Terminated (cleared on read) Mask */
#define ISI_SR_SIP_Pos                        (19)                                           /**< (ISI_SR) Synchronization in Progress Position */
#define ISI_SR_SIP_Msk                        (0x1U << ISI_SR_SIP_Pos)                       /**< (ISI_SR) Synchronization in Progress Mask */
#define ISI_SR_P_OVR_Pos                      (24)                                           /**< (ISI_SR) Preview Datapath Overflow (cleared on read) Position */
#define ISI_SR_P_OVR_Msk                      (0x1U << ISI_SR_P_OVR_Pos)                     /**< (ISI_SR) Preview Datapath Overflow (cleared on read) Mask */
#define ISI_SR_C_OVR_Pos                      (25)                                           /**< (ISI_SR) Codec Datapath Overflow (cleared on read) Position */
#define ISI_SR_C_OVR_Msk                      (0x1U << ISI_SR_C_OVR_Pos)                     /**< (ISI_SR) Codec Datapath Overflow (cleared on read) Mask */
#define ISI_SR_CRC_ERR_Pos                    (26)                                           /**< (ISI_SR) CRC Synchronization Error (cleared on read) Position */
#define ISI_SR_CRC_ERR_Msk                    (0x1U << ISI_SR_CRC_ERR_Pos)                   /**< (ISI_SR) CRC Synchronization Error (cleared on read) Mask */
#define ISI_SR_FR_OVR_Pos                     (27)                                           /**< (ISI_SR) Frame Rate Overrun (cleared on read) Position */
#define ISI_SR_FR_OVR_Msk                     (0x1U << ISI_SR_FR_OVR_Pos)                    /**< (ISI_SR) Frame Rate Overrun (cleared on read) Mask */
#define ISI_SR_Msk                            (0x0F0B0507UL)                                 /**< (ISI_SR) Register Mask  */

/* -------- ISI_IER : (ISI Offset: 0x2c) (/W 32) ISI Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t DIS_DONE:1;                /**< bit:      1  Disable Done Interrupt Enable                 */
    uint32_t SRST:1;                    /**< bit:      2  Software Reset Interrupt Enable               */
    uint32_t :7;                        /**< bit:   3..9  Reserved                                      */
    uint32_t VSYNC:1;                   /**< bit:     10  Vertical Synchronization Interrupt Enable     */
    uint32_t :5;                        /**< bit: 11..15  Reserved                                      */
    uint32_t PXFR_DONE:1;               /**< bit:     16  Preview DMA Transfer Done Interrupt Enable    */
    uint32_t CXFR_DONE:1;               /**< bit:     17  Codec DMA Transfer Done Interrupt Enable      */
    uint32_t :6;                        /**< bit: 18..23  Reserved                                      */
    uint32_t P_OVR:1;                   /**< bit:     24  Preview Datapath Overflow Interrupt Enable    */
    uint32_t C_OVR:1;                   /**< bit:     25  Codec Datapath Overflow Interrupt Enable      */
    uint32_t CRC_ERR:1;                 /**< bit:     26  Embedded Synchronization CRC Error Interrupt Enable */
    uint32_t FR_OVR:1;                  /**< bit:     27  Frame Rate Overflow Interrupt Enable          */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_IER_bits_t;

