zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/isi.h
#define ISI_IER_DIS_DONE_Pos                  (1)                                            /**< (ISI_IER) Disable Done Interrupt Enable Position */
#define ISI_IER_DIS_DONE_Msk                  (0x1U << ISI_IER_DIS_DONE_Pos)                 /**< (ISI_IER) Disable Done Interrupt Enable Mask */
#define ISI_IER_SRST_Pos                      (2)                                            /**< (ISI_IER) Software Reset Interrupt Enable Position */
#define ISI_IER_SRST_Msk                      (0x1U << ISI_IER_SRST_Pos)                     /**< (ISI_IER) Software Reset Interrupt Enable Mask */
#define ISI_IER_VSYNC_Pos                     (10)                                           /**< (ISI_IER) Vertical Synchronization Interrupt Enable Position */
#define ISI_IER_VSYNC_Msk                     (0x1U << ISI_IER_VSYNC_Pos)                    /**< (ISI_IER) Vertical Synchronization Interrupt Enable Mask */
#define ISI_IER_PXFR_DONE_Pos                 (16)                                           /**< (ISI_IER) Preview DMA Transfer Done Interrupt Enable Position */
#define ISI_IER_PXFR_DONE_Msk                 (0x1U << ISI_IER_PXFR_DONE_Pos)                /**< (ISI_IER) Preview DMA Transfer Done Interrupt Enable Mask */
#define ISI_IER_CXFR_DONE_Pos                 (17)                                           /**< (ISI_IER) Codec DMA Transfer Done Interrupt Enable Position */
#define ISI_IER_CXFR_DONE_Msk                 (0x1U << ISI_IER_CXFR_DONE_Pos)                /**< (ISI_IER) Codec DMA Transfer Done Interrupt Enable Mask */
#define ISI_IER_P_OVR_Pos                     (24)                                           /**< (ISI_IER) Preview Datapath Overflow Interrupt Enable Position */
#define ISI_IER_P_OVR_Msk                     (0x1U << ISI_IER_P_OVR_Pos)                    /**< (ISI_IER) Preview Datapath Overflow Interrupt Enable Mask */
#define ISI_IER_C_OVR_Pos                     (25)                                           /**< (ISI_IER) Codec Datapath Overflow Interrupt Enable Position */
#define ISI_IER_C_OVR_Msk                     (0x1U << ISI_IER_C_OVR_Pos)                    /**< (ISI_IER) Codec Datapath Overflow Interrupt Enable Mask */
#define ISI_IER_CRC_ERR_Pos                   (26)                                           /**< (ISI_IER) Embedded Synchronization CRC Error Interrupt Enable Position */
#define ISI_IER_CRC_ERR_Msk                   (0x1U << ISI_IER_CRC_ERR_Pos)                  /**< (ISI_IER) Embedded Synchronization CRC Error Interrupt Enable Mask */
#define ISI_IER_FR_OVR_Pos                    (27)                                           /**< (ISI_IER) Frame Rate Overflow Interrupt Enable Position */
#define ISI_IER_FR_OVR_Msk                    (0x1U << ISI_IER_FR_OVR_Pos)                   /**< (ISI_IER) Frame Rate Overflow Interrupt Enable Mask */
#define ISI_IER_Msk                           (0x0F030406UL)                                 /**< (ISI_IER) Register Mask  */

/* -------- ISI_IDR : (ISI Offset: 0x30) (/W 32) ISI Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t DIS_DONE:1;                /**< bit:      1  Disable Done Interrupt Disable                */
    uint32_t SRST:1;                    /**< bit:      2  Software Reset Interrupt Disable              */
    uint32_t :7;                        /**< bit:   3..9  Reserved                                      */
    uint32_t VSYNC:1;                   /**< bit:     10  Vertical Synchronization Interrupt Disable    */
    uint32_t :5;                        /**< bit: 11..15  Reserved                                      */
    uint32_t PXFR_DONE:1;               /**< bit:     16  Preview DMA Transfer Done Interrupt Disable   */
    uint32_t CXFR_DONE:1;               /**< bit:     17  Codec DMA Transfer Done Interrupt Disable     */
    uint32_t :6;                        /**< bit: 18..23  Reserved                                      */
    uint32_t P_OVR:1;                   /**< bit:     24  Preview Datapath Overflow Interrupt Disable   */
    uint32_t C_OVR:1;                   /**< bit:     25  Codec Datapath Overflow Interrupt Disable     */
    uint32_t CRC_ERR:1;                 /**< bit:     26  Embedded Synchronization CRC Error Interrupt Disable */
    uint32_t FR_OVR:1;                  /**< bit:     27  Frame Rate Overflow Interrupt Disable         */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_IDR_bits_t;

#define ISI_IDR_DIS_DONE_Pos                  (1)                                            /**< (ISI_IDR) Disable Done Interrupt Disable Position */
#define ISI_IDR_DIS_DONE_Msk                  (0x1U << ISI_IDR_DIS_DONE_Pos)                 /**< (ISI_IDR) Disable Done Interrupt Disable Mask */
#define ISI_IDR_SRST_Pos                      (2)                                            /**< (ISI_IDR) Software Reset Interrupt Disable Position */
#define ISI_IDR_SRST_Msk                      (0x1U << ISI_IDR_SRST_Pos)                     /**< (ISI_IDR) Software Reset Interrupt Disable Mask */
#define ISI_IDR_VSYNC_Pos                     (10)                                           /**< (ISI_IDR) Vertical Synchronization Interrupt Disable Position */
#define ISI_IDR_VSYNC_Msk                     (0x1U << ISI_IDR_VSYNC_Pos)                    /**< (ISI_IDR) Vertical Synchronization Interrupt Disable Mask */
#define ISI_IDR_PXFR_DONE_Pos                 (16)                                           /**< (ISI_IDR) Preview DMA Transfer Done Interrupt Disable Position */
#define ISI_IDR_PXFR_DONE_Msk                 (0x1U << ISI_IDR_PXFR_DONE_Pos)                /**< (ISI_IDR) Preview DMA Transfer Done Interrupt Disable Mask */
#define ISI_IDR_CXFR_DONE_Pos                 (17)                                           /**< (ISI_IDR) Codec DMA Transfer Done Interrupt Disable Position */
#define ISI_IDR_CXFR_DONE_Msk                 (0x1U << ISI_IDR_CXFR_DONE_Pos)                /**< (ISI_IDR) Codec DMA Transfer Done Interrupt Disable Mask */
#define ISI_IDR_P_OVR_Pos                     (24)                                           /**< (ISI_IDR) Preview Datapath Overflow Interrupt Disable Position */
#define ISI_IDR_P_OVR_Msk                     (0x1U << ISI_IDR_P_OVR_Pos)                    /**< (ISI_IDR) Preview Datapath Overflow Interrupt Disable Mask */
#define ISI_IDR_C_OVR_Pos                     (25)                                           /**< (ISI_IDR) Codec Datapath Overflow Interrupt Disable Position */
#define ISI_IDR_C_OVR_Msk                     (0x1U << ISI_IDR_C_OVR_Pos)                    /**< (ISI_IDR) Codec Datapath Overflow Interrupt Disable Mask */
#define ISI_IDR_CRC_ERR_Pos                   (26)                                           /**< (ISI_IDR) Embedded Synchronization CRC Error Interrupt Disable Position */
#define ISI_IDR_CRC_ERR_Msk                   (0x1U << ISI_IDR_CRC_ERR_Pos)                  /**< (ISI_IDR) Embedded Synchronization CRC Error Interrupt Disable Mask */
#define ISI_IDR_FR_OVR_Pos                    (27)                                           /**< (ISI_IDR) Frame Rate Overflow Interrupt Disable Position */
#define ISI_IDR_FR_OVR_Msk                    (0x1U << ISI_IDR_FR_OVR_Pos)                   /**< (ISI_IDR) Frame Rate Overflow Interrupt Disable Mask */
#define ISI_IDR_Msk                           (0x0F030406UL)                                 /**< (ISI_IDR) Register Mask  */

/* -------- ISI_IMR : (ISI Offset: 0x34) (R/ 32) ISI Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t DIS_DONE:1;                /**< bit:      1  Module Disable Operation Completed            */
    uint32_t SRST:1;                    /**< bit:      2  Software Reset Completed                      */
    uint32_t :7;                        /**< bit:   3..9  Reserved                                      */
    uint32_t VSYNC:1;                   /**< bit:     10  Vertical Synchronization                      */
    uint32_t :5;                        /**< bit: 11..15  Reserved                                      */
    uint32_t PXFR_DONE:1;               /**< bit:     16  Preview DMA Transfer Completed                */
    uint32_t CXFR_DONE:1;               /**< bit:     17  Codec DMA Transfer Completed                  */
    uint32_t :6;                        /**< bit: 18..23  Reserved                                      */
    uint32_t P_OVR:1;                   /**< bit:     24  Preview FIFO Overflow                         */
    uint32_t C_OVR:1;                   /**< bit:     25  Codec FIFO Overflow                           */
    uint32_t CRC_ERR:1;                 /**< bit:     26  CRC Synchronization Error                     */
    uint32_t FR_OVR:1;                  /**< bit:     27  Frame Rate Overrun                            */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_IMR_bits_t;

#define ISI_IMR_DIS_DONE_Pos                  (1)                                            /**< (ISI_IMR) Module Disable Operation Completed Position */
#define ISI_IMR_DIS_DONE_Msk                  (0x1U << ISI_IMR_DIS_DONE_Pos)                 /**< (ISI_IMR) Module Disable Operation Completed Mask */
#define ISI_IMR_SRST_Pos                      (2)                                            /**< (ISI_IMR) Software Reset Completed Position */
#define ISI_IMR_SRST_Msk                      (0x1U << ISI_IMR_SRST_Pos)                     /**< (ISI_IMR) Software Reset Completed Mask */
#define ISI_IMR_VSYNC_Pos                     (10)                                           /**< (ISI_IMR) Vertical Synchronization Position */
#define ISI_IMR_VSYNC_Msk                     (0x1U << ISI_IMR_VSYNC_Pos)                    /**< (ISI_IMR) Vertical Synchronization Mask */
#define ISI_IMR_PXFR_DONE_Pos                 (16)                                           /**< (ISI_IMR) Preview DMA Transfer Completed Position */
#define ISI_IMR_PXFR_DONE_Msk                 (0x1U << ISI_IMR_PXFR_DONE_Pos)                /**< (ISI_IMR) Preview DMA Transfer Completed Mask */
#define ISI_IMR_CXFR_DONE_Pos                 (17)                                           /**< (ISI_IMR) Codec DMA Transfer Completed Position */
#define ISI_IMR_CXFR_DONE_Msk                 (0x1U << ISI_IMR_CXFR_DONE_Pos)                /**< (ISI_IMR) Codec DMA Transfer Completed Mask */
#define ISI_IMR_P_OVR_Pos                     (24)                                           /**< (ISI_IMR) Preview FIFO Overflow Position */
#define ISI_IMR_P_OVR_Msk                     (0x1U << ISI_IMR_P_OVR_Pos)                    /**< (ISI_IMR) Preview FIFO Overflow Mask */
#define ISI_IMR_C_OVR_Pos                     (25)                                           /**< (ISI_IMR) Codec FIFO Overflow Position */
#define ISI_IMR_C_OVR_Msk                     (0x1U << ISI_IMR_C_OVR_Pos)                    /**< (ISI_IMR) Codec FIFO Overflow Mask */
#define ISI_IMR_CRC_ERR_Pos                   (26)                                           /**< (ISI_IMR) CRC Synchronization Error Position */
#define ISI_IMR_CRC_ERR_Msk                   (0x1U << ISI_IMR_CRC_ERR_Pos)                  /**< (ISI_IMR) CRC Synchronization Error Mask */
#define ISI_IMR_FR_OVR_Pos                    (27)                                           /**< (ISI_IMR) Frame Rate Overrun Position */
#define ISI_IMR_FR_OVR_Msk                    (0x1U << ISI_IMR_FR_OVR_Pos)                   /**< (ISI_IMR) Frame Rate Overrun Mask */
#define ISI_IMR_Msk                           (0x0F030406UL)                                 /**< (ISI_IMR) Register Mask  */

/* -------- ISI_DMA_CHER : (ISI Offset: 0x38) (/W 32) DMA Channel Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t P_CH_EN:1;                 /**< bit:      0  Preview Channel Enable                        */
    uint32_t C_CH_EN:1;                 /**< bit:      1  Codec Channel Enable                          */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_DMA_CHER_bits_t;

#define ISI_DMA_CHER_P_CH_EN_Pos              (0)                                            /**< (ISI_DMA_CHER) Preview Channel Enable Position */
#define ISI_DMA_CHER_P_CH_EN_Msk              (0x1U << ISI_DMA_CHER_P_CH_EN_Pos)             /**< (ISI_DMA_CHER) Preview Channel Enable Mask */
#define ISI_DMA_CHER_C_CH_EN_Pos              (1)                                            /**< (ISI_DMA_CHER) Codec Channel Enable Position */
#define ISI_DMA_CHER_C_CH_EN_Msk              (0x1U << ISI_DMA_CHER_C_CH_EN_Pos)             /**< (ISI_DMA_CHER) Codec Channel Enable Mask */
#define ISI_DMA_CHER_Msk                      (0x00000003UL)                                 /**< (ISI_DMA_CHER) Register Mask  */

