zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/isi.h
/* -------- ISI_DMA_CHDR : (ISI Offset: 0x3c) (/W 32) DMA Channel Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t P_CH_DIS:1;                /**< bit:      0  Preview Channel Disable Request               */
    uint32_t C_CH_DIS:1;                /**< bit:      1  Codec Channel Disable Request                 */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_DMA_CHDR_bits_t;

#define ISI_DMA_CHDR_P_CH_DIS_Pos             (0)                                            /**< (ISI_DMA_CHDR) Preview Channel Disable Request Position */
#define ISI_DMA_CHDR_P_CH_DIS_Msk             (0x1U << ISI_DMA_CHDR_P_CH_DIS_Pos)            /**< (ISI_DMA_CHDR) Preview Channel Disable Request Mask */
#define ISI_DMA_CHDR_C_CH_DIS_Pos             (1)                                            /**< (ISI_DMA_CHDR) Codec Channel Disable Request Position */
#define ISI_DMA_CHDR_C_CH_DIS_Msk             (0x1U << ISI_DMA_CHDR_C_CH_DIS_Pos)            /**< (ISI_DMA_CHDR) Codec Channel Disable Request Mask */
#define ISI_DMA_CHDR_Msk                      (0x00000003UL)                                 /**< (ISI_DMA_CHDR) Register Mask  */

/* -------- ISI_DMA_CHSR : (ISI Offset: 0x40) (R/ 32) DMA Channel Status Register -------- */

typedef union
{
  struct
  {
    uint32_t P_CH_S:1;                  /**< bit:      0  Preview DMA Channel Status                    */
    uint32_t C_CH_S:1;                  /**< bit:      1  Code DMA Channel Status                       */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_DMA_CHSR_bits_t;

#define ISI_DMA_CHSR_P_CH_S_Pos               (0)                                            /**< (ISI_DMA_CHSR) Preview DMA Channel Status Position */
#define ISI_DMA_CHSR_P_CH_S_Msk               (0x1U << ISI_DMA_CHSR_P_CH_S_Pos)              /**< (ISI_DMA_CHSR) Preview DMA Channel Status Mask */
#define ISI_DMA_CHSR_C_CH_S_Pos               (1)                                            /**< (ISI_DMA_CHSR) Code DMA Channel Status Position */
#define ISI_DMA_CHSR_C_CH_S_Msk               (0x1U << ISI_DMA_CHSR_C_CH_S_Pos)              /**< (ISI_DMA_CHSR) Code DMA Channel Status Mask */
#define ISI_DMA_CHSR_Msk                      (0x00000003UL)                                 /**< (ISI_DMA_CHSR) Register Mask  */

/* -------- ISI_DMA_P_ADDR : (ISI Offset: 0x44) (R/W 32) DMA Preview Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t P_ADDR:30;                 /**< bit:  2..31  Preview Image Base Address                    */
  };
  uint32_t w;
} __ISI_DMA_P_ADDR_bits_t;

#define ISI_DMA_P_ADDR_P_ADDR_Pos             (2)                                            /**< (ISI_DMA_P_ADDR) Preview Image Base Address Position */
#define ISI_DMA_P_ADDR_P_ADDR_Msk             (0x3FFFFFFFU << ISI_DMA_P_ADDR_P_ADDR_Pos)     /**< (ISI_DMA_P_ADDR) Preview Image Base Address Mask */
#define ISI_DMA_P_ADDR_P_ADDR(value)          (ISI_DMA_P_ADDR_P_ADDR_Msk & ((value) << ISI_DMA_P_ADDR_P_ADDR_Pos))
#define ISI_DMA_P_ADDR_Msk                    (0xFFFFFFFCUL)                                 /**< (ISI_DMA_P_ADDR) Register Mask  */

/* -------- ISI_DMA_P_CTRL : (ISI Offset: 0x48) (R/W 32) DMA Preview Control Register -------- */

typedef union
{
  struct
  {
    uint32_t P_FETCH:1;                 /**< bit:      0  Descriptor Fetch Control Bit                  */
    uint32_t P_WB:1;                    /**< bit:      1  Descriptor Writeback Control Bit              */
    uint32_t P_IEN:1;                   /**< bit:      2  Transfer Done Flag Control                    */
    uint32_t P_DONE:1;                  /**< bit:      3  Preview Transfer Done                         */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_DMA_P_CTRL_bits_t;

#define ISI_DMA_P_CTRL_P_FETCH_Pos            (0)                                            /**< (ISI_DMA_P_CTRL) Descriptor Fetch Control Bit Position */
#define ISI_DMA_P_CTRL_P_FETCH_Msk            (0x1U << ISI_DMA_P_CTRL_P_FETCH_Pos)           /**< (ISI_DMA_P_CTRL) Descriptor Fetch Control Bit Mask */
#define ISI_DMA_P_CTRL_P_WB_Pos               (1)                                            /**< (ISI_DMA_P_CTRL) Descriptor Writeback Control Bit Position */
#define ISI_DMA_P_CTRL_P_WB_Msk               (0x1U << ISI_DMA_P_CTRL_P_WB_Pos)              /**< (ISI_DMA_P_CTRL) Descriptor Writeback Control Bit Mask */
#define ISI_DMA_P_CTRL_P_IEN_Pos              (2)                                            /**< (ISI_DMA_P_CTRL) Transfer Done Flag Control Position */
#define ISI_DMA_P_CTRL_P_IEN_Msk              (0x1U << ISI_DMA_P_CTRL_P_IEN_Pos)             /**< (ISI_DMA_P_CTRL) Transfer Done Flag Control Mask */
#define ISI_DMA_P_CTRL_P_DONE_Pos             (3)                                            /**< (ISI_DMA_P_CTRL) Preview Transfer Done Position */
#define ISI_DMA_P_CTRL_P_DONE_Msk             (0x1U << ISI_DMA_P_CTRL_P_DONE_Pos)            /**< (ISI_DMA_P_CTRL) Preview Transfer Done Mask */
#define ISI_DMA_P_CTRL_Msk                    (0x0000000FUL)                                 /**< (ISI_DMA_P_CTRL) Register Mask  */

/* -------- ISI_DMA_P_DSCR : (ISI Offset: 0x4c) (R/W 32) DMA Preview Descriptor Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t P_DSCR:30;                 /**< bit:  2..31  Preview Descriptor Base Address               */
  };
  uint32_t w;
} __ISI_DMA_P_DSCR_bits_t;

#define ISI_DMA_P_DSCR_P_DSCR_Pos             (2)                                            /**< (ISI_DMA_P_DSCR) Preview Descriptor Base Address Position */
#define ISI_DMA_P_DSCR_P_DSCR_Msk             (0x3FFFFFFFU << ISI_DMA_P_DSCR_P_DSCR_Pos)     /**< (ISI_DMA_P_DSCR) Preview Descriptor Base Address Mask */
#define ISI_DMA_P_DSCR_P_DSCR(value)          (ISI_DMA_P_DSCR_P_DSCR_Msk & ((value) << ISI_DMA_P_DSCR_P_DSCR_Pos))
#define ISI_DMA_P_DSCR_Msk                    (0xFFFFFFFCUL)                                 /**< (ISI_DMA_P_DSCR) Register Mask  */

/* -------- ISI_DMA_C_ADDR : (ISI Offset: 0x50) (R/W 32) DMA Codec Base Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t C_ADDR:30;                 /**< bit:  2..31  Codec Image Base Address                      */
  };
  uint32_t w;
} __ISI_DMA_C_ADDR_bits_t;

#define ISI_DMA_C_ADDR_C_ADDR_Pos             (2)                                            /**< (ISI_DMA_C_ADDR) Codec Image Base Address Position */
#define ISI_DMA_C_ADDR_C_ADDR_Msk             (0x3FFFFFFFU << ISI_DMA_C_ADDR_C_ADDR_Pos)     /**< (ISI_DMA_C_ADDR) Codec Image Base Address Mask */
#define ISI_DMA_C_ADDR_C_ADDR(value)          (ISI_DMA_C_ADDR_C_ADDR_Msk & ((value) << ISI_DMA_C_ADDR_C_ADDR_Pos))
#define ISI_DMA_C_ADDR_Msk                    (0xFFFFFFFCUL)                                 /**< (ISI_DMA_C_ADDR) Register Mask  */

/* -------- ISI_DMA_C_CTRL : (ISI Offset: 0x54) (R/W 32) DMA Codec Control Register -------- */

typedef union
{
  struct
  {
    uint32_t C_FETCH:1;                 /**< bit:      0  Descriptor Fetch Control Bit                  */
    uint32_t C_WB:1;                    /**< bit:      1  Descriptor Writeback Control Bit              */
    uint32_t C_IEN:1;                   /**< bit:      2  Transfer Done Flag Control                    */
    uint32_t C_DONE:1;                  /**< bit:      3  Codec Transfer Done                           */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_DMA_C_CTRL_bits_t;

#define ISI_DMA_C_CTRL_C_FETCH_Pos            (0)                                            /**< (ISI_DMA_C_CTRL) Descriptor Fetch Control Bit Position */
#define ISI_DMA_C_CTRL_C_FETCH_Msk            (0x1U << ISI_DMA_C_CTRL_C_FETCH_Pos)           /**< (ISI_DMA_C_CTRL) Descriptor Fetch Control Bit Mask */
#define ISI_DMA_C_CTRL_C_WB_Pos               (1)                                            /**< (ISI_DMA_C_CTRL) Descriptor Writeback Control Bit Position */
#define ISI_DMA_C_CTRL_C_WB_Msk               (0x1U << ISI_DMA_C_CTRL_C_WB_Pos)              /**< (ISI_DMA_C_CTRL) Descriptor Writeback Control Bit Mask */
#define ISI_DMA_C_CTRL_C_IEN_Pos              (2)                                            /**< (ISI_DMA_C_CTRL) Transfer Done Flag Control Position */
#define ISI_DMA_C_CTRL_C_IEN_Msk              (0x1U << ISI_DMA_C_CTRL_C_IEN_Pos)             /**< (ISI_DMA_C_CTRL) Transfer Done Flag Control Mask */
#define ISI_DMA_C_CTRL_C_DONE_Pos             (3)                                            /**< (ISI_DMA_C_CTRL) Codec Transfer Done Position */
#define ISI_DMA_C_CTRL_C_DONE_Msk             (0x1U << ISI_DMA_C_CTRL_C_DONE_Pos)            /**< (ISI_DMA_C_CTRL) Codec Transfer Done Mask */
#define ISI_DMA_C_CTRL_Msk                    (0x0000000FUL)                                 /**< (ISI_DMA_C_CTRL) Register Mask  */

