zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/isi.h
/* -------- ISI_DMA_C_DSCR : (ISI Offset: 0x58) (R/W 32) DMA Codec Descriptor Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t C_DSCR:30;                 /**< bit:  2..31  Codec Descriptor Base Address                 */
  };
  uint32_t w;
} __ISI_DMA_C_DSCR_bits_t;

#define ISI_DMA_C_DSCR_C_DSCR_Pos             (2)                                            /**< (ISI_DMA_C_DSCR) Codec Descriptor Base Address Position */
#define ISI_DMA_C_DSCR_C_DSCR_Msk             (0x3FFFFFFFU << ISI_DMA_C_DSCR_C_DSCR_Pos)     /**< (ISI_DMA_C_DSCR) Codec Descriptor Base Address Mask */
#define ISI_DMA_C_DSCR_C_DSCR(value)          (ISI_DMA_C_DSCR_C_DSCR_Msk & ((value) << ISI_DMA_C_DSCR_C_DSCR_Pos))
#define ISI_DMA_C_DSCR_Msk                    (0xFFFFFFFCUL)                                 /**< (ISI_DMA_C_DSCR) Register Mask  */

/* -------- ISI_WPMR : (ISI Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key Password                 */
  };
  uint32_t w;
} __ISI_WPMR_bits_t;

#define ISI_WPMR_WPEN_Pos                     (0)                                            /**< (ISI_WPMR) Write Protection Enable Position */
#define ISI_WPMR_WPEN_Msk                     (0x1U << ISI_WPMR_WPEN_Pos)                    /**< (ISI_WPMR) Write Protection Enable Mask */
#define ISI_WPMR_WPKEY_Pos                    (8)                                            /**< (ISI_WPMR) Write Protection Key Password Position */
#define ISI_WPMR_WPKEY_Msk                    (0xFFFFFFU << ISI_WPMR_WPKEY_Pos)              /**< (ISI_WPMR) Write Protection Key Password Mask */
#define ISI_WPMR_WPKEY(value)                 (ISI_WPMR_WPKEY_Msk & ((value) << ISI_WPMR_WPKEY_Pos))
#define   ISI_WPMR_WPKEY_PASSWD_Val           (0x495349U)                                    /**< (ISI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define ISI_WPMR_WPKEY_PASSWD                 (ISI_WPMR_WPKEY_PASSWD_Val << ISI_WPMR_WPKEY_Pos)  /**< (ISI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define ISI_WPMR_Msk                          (0xFFFFFF01UL)                                 /**< (ISI_WPMR) Register Mask  */

/* -------- ISI_WPSR : (ISI Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __ISI_WPSR_bits_t;

#define ISI_WPSR_WPVS_Pos                     (0)                                            /**< (ISI_WPSR) Write Protection Violation Status Position */
#define ISI_WPSR_WPVS_Msk                     (0x1U << ISI_WPSR_WPVS_Pos)                    /**< (ISI_WPSR) Write Protection Violation Status Mask */
#define ISI_WPSR_WPVSRC_Pos                   (8)                                            /**< (ISI_WPSR) Write Protection Violation Source Position */
#define ISI_WPSR_WPVSRC_Msk                   (0xFFFFU << ISI_WPSR_WPVSRC_Pos)               /**< (ISI_WPSR) Write Protection Violation Source Mask */
#define ISI_WPSR_WPVSRC(value)                (ISI_WPSR_WPVSRC_Msk & ((value) << ISI_WPSR_WPVSRC_Pos))
#define ISI_WPSR_Msk                          (0x00FFFF01UL)                                 /**< (ISI_WPSR) Register Mask  */

/** \brief ISI register offsets definitions */
#define ISI_CFG1_OFFSET              (0x00)         /**< (ISI_CFG1) ISI Configuration 1 Register Offset */
#define ISI_CFG2_OFFSET              (0x04)         /**< (ISI_CFG2) ISI Configuration 2 Register Offset */
#define ISI_PSIZE_OFFSET             (0x08)         /**< (ISI_PSIZE) ISI Preview Size Register Offset */
#define ISI_PDECF_OFFSET             (0x0C)         /**< (ISI_PDECF) ISI Preview Decimation Factor Register Offset */
#define ISI_Y2R_SET0_OFFSET          (0x10)         /**< (ISI_Y2R_SET0) ISI Color Space Conversion YCrCb To RGB Set 0 Register Offset */
#define ISI_Y2R_SET1_OFFSET          (0x14)         /**< (ISI_Y2R_SET1) ISI Color Space Conversion YCrCb To RGB Set 1 Register Offset */
#define ISI_R2Y_SET0_OFFSET          (0x18)         /**< (ISI_R2Y_SET0) ISI Color Space Conversion RGB To YCrCb Set 0 Register Offset */
#define ISI_R2Y_SET1_OFFSET          (0x1C)         /**< (ISI_R2Y_SET1) ISI Color Space Conversion RGB To YCrCb Set 1 Register Offset */
#define ISI_R2Y_SET2_OFFSET          (0x20)         /**< (ISI_R2Y_SET2) ISI Color Space Conversion RGB To YCrCb Set 2 Register Offset */
#define ISI_CR_OFFSET                (0x24)         /**< (ISI_CR) ISI Control Register Offset */
#define ISI_SR_OFFSET                (0x28)         /**< (ISI_SR) ISI Status Register Offset */
#define ISI_IER_OFFSET               (0x2C)         /**< (ISI_IER) ISI Interrupt Enable Register Offset */
#define ISI_IDR_OFFSET               (0x30)         /**< (ISI_IDR) ISI Interrupt Disable Register Offset */
#define ISI_IMR_OFFSET               (0x34)         /**< (ISI_IMR) ISI Interrupt Mask Register Offset */
#define ISI_DMA_CHER_OFFSET          (0x38)         /**< (ISI_DMA_CHER) DMA Channel Enable Register Offset */
#define ISI_DMA_CHDR_OFFSET          (0x3C)         /**< (ISI_DMA_CHDR) DMA Channel Disable Register Offset */
#define ISI_DMA_CHSR_OFFSET          (0x40)         /**< (ISI_DMA_CHSR) DMA Channel Status Register Offset */
#define ISI_DMA_P_ADDR_OFFSET        (0x44)         /**< (ISI_DMA_P_ADDR) DMA Preview Base Address Register Offset */
#define ISI_DMA_P_CTRL_OFFSET        (0x48)         /**< (ISI_DMA_P_CTRL) DMA Preview Control Register Offset */
#define ISI_DMA_P_DSCR_OFFSET        (0x4C)         /**< (ISI_DMA_P_DSCR) DMA Preview Descriptor Address Register Offset */
#define ISI_DMA_C_ADDR_OFFSET        (0x50)         /**< (ISI_DMA_C_ADDR) DMA Codec Base Address Register Offset */
#define ISI_DMA_C_CTRL_OFFSET        (0x54)         /**< (ISI_DMA_C_CTRL) DMA Codec Control Register Offset */
#define ISI_DMA_C_DSCR_OFFSET        (0x58)         /**< (ISI_DMA_C_DSCR) DMA Codec Descriptor Address Register Offset */
#define ISI_WPMR_OFFSET              (0xE4)         /**< (ISI_WPMR) Write Protection Mode Register Offset */
#define ISI_WPSR_OFFSET              (0xE8)         /**< (ISI_WPSR) Write Protection Status Register Offset */

/** \brief ISI register API structure */
typedef struct
{
  __IO  __ISI_CFG1_bits_t              ISI_CFG1;      /**< Offset: 0x00 (R/W  32) ISI Configuration 1 Register */
  __IO  __ISI_CFG2_bits_t              ISI_CFG2;      /**< Offset: 0x04 (R/W  32) ISI Configuration 2 Register */
  __IO  __ISI_PSIZE_bits_t             ISI_PSIZE;     /**< Offset: 0x08 (R/W  32) ISI Preview Size Register */
  __IO  __ISI_PDECF_bits_t             ISI_PDECF;     /**< Offset: 0x0C (R/W  32) ISI Preview Decimation Factor Register */
  __IO  __ISI_Y2R_SET0_bits_t          ISI_Y2R_SET0;  /**< Offset: 0x10 (R/W  32) ISI Color Space Conversion YCrCb To RGB Set 0 Register */
  __IO  __ISI_Y2R_SET1_bits_t          ISI_Y2R_SET1;  /**< Offset: 0x14 (R/W  32) ISI Color Space Conversion YCrCb To RGB Set 1 Register */
  __IO  __ISI_R2Y_SET0_bits_t          ISI_R2Y_SET0;  /**< Offset: 0x18 (R/W  32) ISI Color Space Conversion RGB To YCrCb Set 0 Register */
  __IO  __ISI_R2Y_SET1_bits_t          ISI_R2Y_SET1;  /**< Offset: 0x1C (R/W  32) ISI Color Space Conversion RGB To YCrCb Set 1 Register */
  __IO  __ISI_R2Y_SET2_bits_t          ISI_R2Y_SET2;  /**< Offset: 0x20 (R/W  32) ISI Color Space Conversion RGB To YCrCb Set 2 Register */
  __O   __ISI_CR_bits_t                ISI_CR;        /**< Offset: 0x24 ( /W  32) ISI Control Register */
  __I   __ISI_SR_bits_t                ISI_SR;        /**< Offset: 0x28 (R/   32) ISI Status Register */
  __O   __ISI_IER_bits_t               ISI_IER;       /**< Offset: 0x2C ( /W  32) ISI Interrupt Enable Register */
  __O   __ISI_IDR_bits_t               ISI_IDR;       /**< Offset: 0x30 ( /W  32) ISI Interrupt Disable Register */
  __I   __ISI_IMR_bits_t               ISI_IMR;       /**< Offset: 0x34 (R/   32) ISI Interrupt Mask Register */
  __O   __ISI_DMA_CHER_bits_t          ISI_DMA_CHER;  /**< Offset: 0x38 ( /W  32) DMA Channel Enable Register */
  __O   __ISI_DMA_CHDR_bits_t          ISI_DMA_CHDR;  /**< Offset: 0x3C ( /W  32) DMA Channel Disable Register */
  __I   __ISI_DMA_CHSR_bits_t          ISI_DMA_CHSR;  /**< Offset: 0x40 (R/   32) DMA Channel Status Register */
  __IO  __ISI_DMA_P_ADDR_bits_t        ISI_DMA_P_ADDR; /**< Offset: 0x44 (R/W  32) DMA Preview Base Address Register */
  __IO  __ISI_DMA_P_CTRL_bits_t        ISI_DMA_P_CTRL; /**< Offset: 0x48 (R/W  32) DMA Preview Control Register */
  __IO  __ISI_DMA_P_DSCR_bits_t        ISI_DMA_P_DSCR; /**< Offset: 0x4C (R/W  32) DMA Preview Descriptor Address Register */
  __IO  __ISI_DMA_C_ADDR_bits_t        ISI_DMA_C_ADDR; /**< Offset: 0x50 (R/W  32) DMA Codec Base Address Register */
  __IO  __ISI_DMA_C_CTRL_bits_t        ISI_DMA_C_CTRL; /**< Offset: 0x54 (R/W  32) DMA Codec Control Register */
  __IO  __ISI_DMA_C_DSCR_bits_t        ISI_DMA_C_DSCR; /**< Offset: 0x58 (R/W  32) DMA Codec Descriptor Address Register */
  __I   uint8_t                        Reserved1[0x88];
  __IO  __ISI_WPMR_bits_t              ISI_WPMR;      /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __ISI_WPSR_bits_t              ISI_WPSR;      /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} isi_registers_t;
/** @}  end of Image Sensor Interface */

#endif /* _PIC32CZ_CA70_ISI_COMPONENT_H_ */
